In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
data = Series([1,2,3,7,4,np.nan,np.nan,9])

In [3]:
data

0    1.0
1    2.0
2    3.0
3    7.0
4    4.0
5    NaN
6    NaN
7    9.0
dtype: float64

In [4]:
data.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
dtype: bool

In [8]:
data.isna()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
dtype: bool

In [9]:
data.dropna()#inplace should be set to true in order to alter the original series

0    1.0
1    2.0
2    3.0
3    7.0
4    4.0
7    9.0
dtype: float64

In [10]:
data

0    1.0
1    2.0
2    3.0
3    7.0
4    4.0
5    NaN
6    NaN
7    9.0
dtype: float64

In [24]:
dframe = pd.DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,np.nan],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [25]:
clean_dframe = dframe.dropna()

In [26]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [27]:
dframe.dropna(how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  NaN

In [28]:
dframe.dropna(how = 'any')

     0    1    2
0  1.0  2.0  3.0

In [32]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [33]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])

In [34]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [35]:
dframe2.dropna(thresh=2) #thresh indicates minimum required values to be present

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [36]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [37]:
dframe.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  1.0
3  1.0  1.0  1.0

In [38]:
dframe2.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [39]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [40]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [43]:
dframe2 = dframe2.fillna(0)
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

---

Index Hierarchy

index of index

In [44]:
from numpy.random import randn

In [45]:
ser = Series(randn(6),index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [46]:
ser

1  a    1.157178
   b   -1.082984
   c    1.308529
2  a    0.696034
   b    1.310592
   c   -0.767088
dtype: float64

In [48]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [49]:
ser[1]

a    1.157178
b   -1.082984
c    1.308529
dtype: float64

In [50]:
ser[2]

a    0.696034
b    1.310592
c   -0.767088
dtype: float64

In [51]:
ser[:,'a']

1    1.157178
2    0.696034
dtype: float64

In [52]:
dframe = ser.unstack()

In [53]:
dframe

          a         b         c
1  1.157178 -1.082984  1.308529
2  0.696034  1.310592 -0.767088

In [54]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [55]:
dframe2.index.names = ['INDEX_1','INDEX_2']

dframe2.columns.names = ['Cities','Temp']

dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [56]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [58]:
dframe2.sort_index(1)

Cities           LA   NY       SF
Temp            hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [63]:
dframe2.sum(level = 'Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27